results-n1-standard-8-60-second-tests/0006-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 6

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0    ✗ 946
    checks.....................: 100.00% ✓ 2838 ✗ 0  
    data_received..............: 454 MB  7.6 MB/s
    data_sent..................: 1.6 MB  27 kB/s
    group_duration.............: avg=190.31ms min=176.79ms med=183.64ms max=702.59ms p(90)=196.43ms p(95)=209.31ms
    http_req_blocked...........: avg=29µs     min=160ns    med=343ns    max=122.15ms p(90)=825ns    p(95)=1µs     
    http_req_connecting........: avg=10.04µs  min=0s       med=0s       max=23.26ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=35.23ms  min=23.17ms  med=31.4ms   max=570.29ms p(90)=48.45ms  p(95)=66.7ms  
    http_req_receiving.........: avg=1.24ms   min=36.4µs   med=234.96µs max=97.19ms  p(90)=3.52ms   p(95)=4.92ms  
    http_req_sending...........: avg=27.65µs  min=10.69µs  med=25.9µs   max=1.04ms   p(90)=40.77µs  p(95)=45.96µs 
    http_req_tls_handshaking...: avg=16.33µs  min=0s       med=0s       max=82.28ms  p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=33.96ms  min=23.06ms  med=29.91ms  max=570.05ms p(90)=45.54ms  p(95)=65.64ms 
    http_reqs..................: 11357   189.283071/s
    iteration_duration.........: avg=190.33ms min=176.8ms  med=183.66ms max=702.61ms p(90)=196.45ms p(95)=209.33ms
    iterations.................: 943     15.716645/s
    vus........................: 5       min=1  max=5
    vus_max....................: 6       min=6  max=6