results-n1-standard-8-60-second-tests/0012-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 12

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0    ✗ 1933
    checks.....................: 100.00% ✓ 5799 ✗ 0   
    data_received..............: 928 MB  16 MB/s
    data_sent..................: 3.3 MB  56 kB/s
    group_duration.............: avg=186.08ms min=176.54ms med=182.85ms max=656.97ms p(90)=191.19ms p(95)=196.8ms 
    http_req_blocked...........: avg=27.6µs   min=157ns    med=346ns    max=133.13ms p(90)=838ns    p(95)=1.01µs  
    http_req_connecting........: avg=10.77µs  min=0s       med=0s       max=23.25ms  p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=34.52ms  min=23.21ms  med=30.87ms  max=556.19ms p(90)=48.64ms  p(95)=65.98ms 
    http_req_receiving.........: avg=1.13ms   min=32.98µs  med=235.64µs max=83.21ms  p(90)=3.45ms   p(95)=4.22ms  
    http_req_sending...........: avg=27.9µs   min=10.74µs  med=26.56µs  max=448.86µs p(90)=40.92µs  p(95)=45.59µs 
    http_req_tls_handshaking...: avg=15.05µs  min=0s       med=0s       max=95.6ms   p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=33.35ms  min=23.08ms  med=29.46ms  max=555.74ms p(90)=45.28ms  p(95)=65.06ms 
    http_reqs..................: 23236   387.266067/s
    iteration_duration.........: avg=186.1ms  min=176.56ms med=182.88ms max=656.99ms p(90)=191.21ms p(95)=196.82ms
    iterations.................: 1929    32.14995/s
    vus........................: 11      min=1  max=11
    vus_max....................: 12      min=12 max=12