results-n1-standard-8-60-second-tests/0025-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 25

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0     ✗ 4053
    checks.....................: 100.00% ✓ 12159 ✗ 0   
    data_received..............: 1.9 GB  32 MB/s
    data_sent..................: 6.9 MB  115 kB/s
    group_duration.............: avg=185ms    min=175.57ms med=182.5ms  max=701.01ms p(90)=190.29ms p(95)=195.07ms
    http_req_blocked...........: avg=28.46µs  min=157ns    med=350ns    max=124.14ms p(90)=849ns    p(95)=1.02µs  
    http_req_connecting........: avg=11.75µs  min=0s       med=0s       max=23.6ms   p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=34.17ms  min=23.13ms  med=30.42ms  max=599.86ms p(90)=49.24ms  p(95)=66.01ms 
    http_req_receiving.........: avg=1.22ms   min=34.94µs  med=259µs    max=68.78ms  p(90)=3.54ms   p(95)=4.08ms  
    http_req_sending...........: avg=28.55µs  min=10.78µs  med=27.19µs  max=1.41ms   p(90)=41.48µs  p(95)=47.41µs 
    http_req_tls_handshaking...: avg=14.55µs  min=0s       med=0s       max=99.86ms  p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=32.92ms  min=23.01ms  med=29.09ms  max=597.18ms p(90)=45.24ms  p(95)=64.97ms 
    http_reqs..................: 48687   811.44897/s
    iteration_duration.........: avg=185.03ms min=175.6ms  med=182.52ms max=701.03ms p(90)=190.33ms p(95)=195.21ms
    iterations.................: 4041    67.349915/s
    vus........................: 24      min=1   max=24
    vus_max....................: 25      min=25  max=25